<template>
  <div class="header__sidebar" :class="state">
    Какая-то вообще неважная информация, но мне нужно было что-то засунуть сюда, поэтому вот!
    <br/>
    <hr/>
    <strong>Alarm!!! Сайт находится только на начальном этапе структурирования, поэтому все кнопки и ссылки, а также системы оценивания не работают, вскоре будет разрабатываться страница блога, сразу после этого будет разработка базы данных сайта и в конце он будет поставлен на хороший хостинг, который будет оплачиваться, будет нанят SEO-специалист, но об этом пока-что думаю...</strong> 
  </div>
</template>

<script>
export default {
  name: 'SideBar',
  props: {
    state: {
      type: String
    }
  }
}
</script>