{
  "posts": [
    {
      "id": 33003954433443,
      "title": "Мой первый пост. Ура!",
      "text": "Всем привет! Это мой первый пост с момента создания и рефакторинга, хоть и неполного, сайта. Я поздравляю вас, мои читатели в сфере ИТ, а также самого себя. Эх... Знали б вы, сколько сил и упорства прошел этот сайт с момента только идеи его создания. Но сейчас я наконец-то заканчиваю его разработку и скоро уже буду приступать к его поддержке. Будущее сайта очень хорошее, я сам это вижу. В обозримом будущем он будет подвергнут разработке backend-части. Но когда это будет - одному Богу известно, так как я вообще ничего про бэк не знаю, ни разу с ним не работал, даже не знаю, какие фреймворки можно использовать, или языки программирования. Немного пошарив в ютубе, я видел как просто работу с mysql + Node JS, так и работу с express + Node JS + mongo DB, видел также работу с firebase, но все это для меня чуждо, покрайней мере - пока :) Но я думаю, мне потребуется еще как минимум месяц, а то и два или больше активного изучения работ с базами данных. Пока что это все, но мой следующий пост скорее всего будет про то, с чего начался мой интерес к веб-разработке, с какими людьми я в итоге познакомился и даже на каком проекте я успел поработать (Об этом уже написано кратко на главной странице сайта.) Ну, в общем на этот пост это завершающая информация. Спасибо всем, скоро увидимся!",
      "img": "https://i.postimg.cc/GtC0kWyZ/Group-84.png",
      "rating": 5,
      "date": "2024-05-02"
    },
    {
      "id": 1863030363463,
      "title": "Статика уже на гитхаб!",
      "text": "Наконец-то я выложил на гитхаб этот сайт, я настолько ненавижу гитхаб, поскольку надо пройти 9 кругов ада, чтобы выложить проект в деплой, так как там всегда все меняется, а документации нет.",
      "img": "https://i.ytimg.com/vi/c0Qmw_mtS1w/maxresdefault.jpg",
      "rating": 5,
      "date": "2024-15-02"
    }
  ],
  "portfolio": [
    {
      "title": "Авторизация GTA 5 Role Play",
      "URL": "https://dannygolds.github.io/authNew/",
      "stack": ["webpack", "vue", "sass", "js"],
      "date": "2024-01-03"
    },
    {
      "title": "Лэндинг-портфолио",
      "stack": ["gulp", "vue", "sass"],
      "URL": "https://dannygolds.github.io/portfolio/",
      "date": "2022-04-30"
    },
    {
      "title": "Инвентарь GTA-5 RP 'emerald'",
      "URL": "https://dannygolds.github.io/inv/",
      "stack": ["webpack", "vue", "sass"],
      "date": "2022-06-30"
    },
    {
      "title": "Сайт-лендинг \"IDEA\"",
      "URL": "https://dannygolds.github.io/IDEA/",
      "stack": ["gulp", "js", "sass"],
      "date": "2021-08-14"
    },
    {
      "title": "Сайт \"Nelli make-up\"",
      "URL": "https://dannygolds.github.io/makeup/",
      "stack": ["html", "css", "js"],
      "date": "2022-05-04"
    }
  ],
  "about-me": {
    "photo": "https://sun9-15.userapi.com/impg/IaqvqnoX7RBVrkxdOvZ68TbtN5WDMteoe78--g/9VuULx7UiZE.jpg?size=1215x2160&quality=95&sign=ec66d43c16267af297ce948a46919459&type=album",
    "text": "Здравствуй, дорогой друг! Меня зовут Даниил. Мне 19 лет. Занимаюсь веб-разработкой с 2021 года, где-то с середины. Сначала моё продвижение в разработке было медленным, но после середины 2022 примерно, я начал заниматься не только версткой, а так же начала изучать JavaScript vanilla, Vue JS параллельно. Здесь интерес к веб-разработке все больше и больше подступал к возрастанию, так как мне стало очень интересно, откуда что берется, как делаются сложные вещи на JS. С середины 2022 года я начал работать в сфере ГТА 5 РП, мы с ребятами работали хорошо, но, к сожалению, моих знаний на тот момент не хватало, поэтому идею пришлось отложить. Сейчас я изучаю в угллубленном режиме документацию Vue JS, а так же параллельно с ней, я начала изучать React JS, так как мне показалось, что вакансий на реакт намного больше, чем на вью, хотя это странно, учитывая легкость управления с вью, а так же его стейт-менеджером VueX, нежели Redux, может быть, люди думают, что вью ненадежный, но все же, в нем есть composition API, TS уже поддерживается, что не хватает IT-гигантам на подобии Яндекса - я не знаю, знаю лишь то, что на реакте приходится тратить раза в полтора больше времени, чем во вью. Ну вот примерно моя история такова. Тут я и поделился личным мнением и рассказал о себе в общих чертах. Эта запись действительна на момент рефакторинга этого сайта. Она будет не будет обновляться. Но сегодня 11 февраля 2024 года. Спасибо за уделенное внимание, дружочек-пирожочек :) Пока! "
  }
}
